tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
#include "FarmFeederApp.h"

#include <Arduino.h>
#include <Esp32Base.h>

#include <esp_system.h>
#include <Wire.h>

#include <cstdlib>
#include <cstring>

#include "FeederBucket.h"
#include "FeederBucketRestore.h"
#include "FeederConfirm.h"
#include "FeederController.h"
#include "FeederDate.h"
#include "FeederFeedSettlement.h"
#include "FeederPersistenceStore.h"
#include "FeederRecordFileStore.h"
#include "FeederRecordLog.h"
#include "FeederRunTracker.h"
#include "FeederSchedule.h"
#include "FeederStorageLayout.h"
#include "FeederTarget.h"
#include "FeederToday.h"

namespace {

FeederController g_feeder;
FeederControllerConfig g_feederConfig;
FeederScheduleService g_schedules;
FeederBucketService g_buckets;
FeederTargetService g_targets;
FeederTodayService g_today;
FeederRunTracker g_runs;
FeederRecordLog g_records;
FeederConfirmGuard g_confirm;
uint32_t g_nextCommandId = 1;
uint16_t g_lastScheduleMinute = 24 * 60;
uint32_t g_lastScheduleDate = 0;
bool g_recordStorageReady = false;
Esp32At24cRecordStore::ArduinoWireI2cBus g_at24cBus;
Esp32At24cRecordStore::At24cI2cDevice g_at24cDevice(g_at24cBus, {});
Esp32At24cRecordStore::RecordStore g_at24cStore;
bool g_at24cStoreReady = false;

static constexpr uint8_t kFarmFeederRouteCount = 29;
static constexpr uint8_t kFeederI2cSda = 21;
static constexpr uint8_t kFeederI2cScl = 22;
static constexpr const char* kFeederRecordRootDir = "/records";
static constexpr const char* kFeederRecordDir = "/records/feeder";
static constexpr const char* kFeederRecordCurrentPath = "/records/feeder/current.far";
static constexpr uint32_t kFeederRecordMaxCurrentBytes = 64UL * 1024UL;
static constexpr uint8_t kFeederRecordMaxArchives = 16;
static_assert(ESP32BASE_WEB_MAX_ROUTES >= kFarmFeederRouteCount,
              "Esp32FarmFeeder requires ESP32BASE_WEB_MAX_ROUTES >= 29");

uint8_t configuredChannelMask() {
  return static_cast<uint8_t>((1U << kFeederConfiguredChannels) - 1U);
}

bool validAppChannel(uint8_t channel) {
  return channel < kFeederConfiguredChannels;
}

bool schedulePlanExists(uint8_t planId) {
  const FeederScheduleSnapshot snapshot = g_schedules.snapshot();
  for (uint8_t i = 0; i < snapshot.planCount; ++i) {
    if (snapshot.plans[i].config.planId == planId) {
      return true;
    }
  }
  return false;
}

void addFarmFeederApi(const char* path, Esp32BaseWeb::Handler handler) {
  if (!Esp32BaseWeb::addApi(path, handler)) {
    ESP32BASE_LOG_E("farmfeeder", "api_route_register_failed path=%s", path);
  }
}

void sendFarmAutoBusinessStyle() {
  Esp32BaseWeb::sendChunk(
      "<style>"
      "main.page{max-width:980px;margin:0 auto}"
      "main.page>h1{font-size:24px;margin:4px 0 14px}"
      "main.page>section{background:#fff;border:1px solid #d8e0e6;border-radius:8px;box-shadow:0 1px 3px rgba(16,24,40,.06);padding:14px 16px;margin:14px 0}"
      "main.page>section>h2{font-size:18px;margin:0 0 12px;padding-bottom:10px;border-bottom:1px solid #e5ebef}"
      "table{width:100%;border-collapse:collapse;margin:8px 0 4px;background:#fff}"
      "th,td{border-bottom:1px solid #e5ebef;padding:9px 8px;text-align:left;vertical-align:top}"
      "th{color:#64707d;font-size:13px;font-weight:700;background:#f8faf9}"
      "tr:last-child td{border-bottom:0}"
      "select,textarea{width:100%;font-size:14px;padding:7px 9px;margin:0 0 12px;border:1px solid #ccd5dd;border-radius:5px;box-sizing:border-box;background:#fff;color:#1f2933}"
      "fieldset{border:1px solid #d8e0e6;border-radius:7px;padding:10px 12px;margin:10px 0;background:#fbfcfc}"
      "legend{font-weight:700;color:#25313f;padding:0 4px}"
      "form{margin:0}"
      "td form{display:flex;flex-wrap:wrap;gap:6px;align-items:center;margin:0 0 6px}"
      "td form input:not([type]),td form input[type=text],td form input[type=number]{width:12ch;margin:0}"
      "td form button{margin:0}"
      "section>a,form>a{display:inline-block;padding:7px 10px;border:1px solid #ccd5dd;border-radius:5px;background:#fff;margin:0 6px 6px 0}"
      ".hint{color:#64707d;font-size:13px}"
      "@media(max-width:720px){body{padding:8px}main.page>h1{font-size:22px}main.page>section{padding:12px;margin:10px 0;overflow-x:auto}"
      "table{font-size:13px;min-width:620px}fieldset{padding:9px}td form{display:block}td form input:not([type]),td form input[type=text],td form input[type=number]{width:100%;margin:0 0 6px}}"
      "</style>");
}

void beginRawJson(int code) {
  Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
}

void endRawJson() {
  Esp32BaseWeb::endResponse();
}

bool requireApiAuth() {
  return Esp32BaseWeb::checkAuth();
}

bool i2cDeviceOnline(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

uint32_t allocateCommandId() {
  const uint32_t commandId = g_nextCommandId;
  ++g_nextCommandId;
  if (g_nextCommandId == 0) {
    g_nextCommandId = 1;
  }
  return commandId;
}

void syncFeederConfigFromBaseInfo() {
  g_feederConfig.enabledChannelMask = static_cast<uint8_t>(
      g_buckets.enabledChannelMask() & g_feederConfig.installedChannelMask & configuredChannelMask());
  const FeederCommandResult result = g_feeder.configure(g_feederConfig);
  g_runs.stopAll();
  if (result != FeederCommandResult::Ok) {
    ESP32BASE_LOG_E("farmfeeder", "feeder_config_sync_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

bool at24cWriteOk(Esp32At24cRecordStore::Result result) {
  return result == Esp32At24cRecordStore::Result::Ok ||
         result == Esp32At24cRecordStore::Result::Unchanged;
}

void persistFeederScheduleIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederSchedule(g_at24cStore, g_schedules.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "schedule_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederTodayIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result = saveFeederToday(g_at24cStore, g_today.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "today_save_failed result=%u", static_cast<unsigned>(result));
  }
}

void persistFeederTargetsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederTargets(g_at24cStore, g_targets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "targets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

void persistFeederBucketsIfReady() {
  if (!g_at24cStoreReady) {
    return;
  }
  const Esp32At24cRecordStore::Result result =
      saveFeederBuckets(g_at24cStore, g_buckets.snapshot());
  if (!at24cWriteOk(result)) {
    ESP32BASE_LOG_W("farmfeeder", "buckets_save_failed result=%u",
                    static_cast<unsigned>(result));
  }
}

