tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const FeederSnapshot snapshot = g_feeder.snapshot();
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  Esp32BaseWeb::sendHeader("喂食器首页");
  Esp32BaseWeb::sendChunk("<h1>喂食器首页</h1><section><h2>喂食状态</h2><table>");
  Esp32BaseWeb::sendChunk("<tr><th>设备状态</th><td>");
  Esp32BaseWeb::sendChunk(deviceStateName(snapshot.state));
  Esp32BaseWeb::sendChunk("</td></tr><tr><th>运行通道</th><td>");
  sendUint8(snapshot.runningChannelMask);
  Esp32BaseWeb::sendChunk("</td></tr></table></section><section><h2>手工喂食</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/feeders/manual-start'>");
  Esp32BaseWeb::sendChunk("<p>勾选要手工喂食的通道；目标留空时使用已保存默认目标。</p>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t channelNumber = static_cast<uint8_t>(i + 1);
    const FeederChannelBaseInfo& info = buckets.channels[i].baseInfo;
    Esp32BaseWeb::sendChunk("<fieldset><legend>");
    Esp32BaseWeb::writeHtmlEscaped(info.name);
    Esp32BaseWeb::sendChunk("</legend><label><input type='checkbox' name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Enabled' value='1'");
    if (!info.enabled) {
      Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("> 参与本次手工喂食</label><label>目标模式 <select name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Mode'><option value=''>使用默认目标</option><option value='grams'>按克数</option><option value='revolutions'>按圈数</option></select></label><label>克数 <input name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Grams' placeholder='例如 70'></label><label>圈数 <input name='ch");
    sendUint8(channelNumber);
    Esp32BaseWeb::sendChunk("Revolutions' placeholder='例如 1.5'></label></fieldset>");
  }
  Esp32BaseWeb::sendChunk("<button>开始手工喂食</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/feeders/stop-all'><button>停止全部</button></form>");
  Esp32BaseWeb::sendChunk("</section><section><h2>料桶余量</h2><table><tr><th>通道</th><th>当前估算</th><th>满桶容量</th><th>维护</th></tr>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = buckets.channels[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::writeHtmlEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendFixedX100(channel.remainGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td>");
    sendFixedX100(channel.baseInfo.capacityGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td><form method='post' action='/api/app/buckets/set-remaining'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><input name='remainGrams' placeholder='当前克数'><button>设置余量</button></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/buckets/add-feed'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><input name='addedGrams' placeholder='加料克数'><button>记录加料</button></form>");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/buckets/mark-full'><input type='hidden' name='channel' value='");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'><button>标记已满</button></form></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendSchedulePage() {
#if ESP32BASE_ENABLE_WEB
  const FeederScheduleSnapshot schedules = g_schedules.snapshot();
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  uint32_t tomorrowDate = 0;
  feederNextServiceDate(schedules.serviceDate, tomorrowDate);
  Esp32BaseWeb::sendHeader("计划");
  Esp32BaseWeb::sendChunk("<h1>计划</h1>");
  sendOccurrenceTable(schedules, buckets, schedules.serviceDate, "今日计划");
  sendOccurrenceTable(schedules, buckets, tomorrowDate, "明日计划");
  Esp32BaseWeb::sendChunk("<section><h2>计划管理</h2><p>计划管理只维护长期蓝本；跳过只在今日或明日执行实例上操作。</p>");
  Esp32BaseWeb::sendChunk("<p><a href='/schedule/edit'>新增计划</a> · <a href='/api/app/schedules'>查看计划 JSON</a></p>");
  Esp32BaseWeb::sendChunk("<table><tr><th>ID</th><th>名称</th><th>时间</th><th>启用</th><th>目标</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < schedules.planCount; ++i) {
    const FeederPlanState& plan = schedules.plans[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.config.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTime(plan.config.timeMinutes);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(plan.config.enabled ? "是" : "否");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTargetSummary(plan.config, buckets);
    Esp32BaseWeb::sendChunk("</td><td><a href='/schedule/edit?planId=");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendScheduleEditPage() {
#if ESP32BASE_ENABLE_WEB
  FeederPlanConfig config;
  bool editing = false;
  uint8_t planId = 0;
  if (Esp32BaseWeb::hasParam("planId")) {
    editing = readUint8Param("planId", planId) && findPlanConfig(planId, config);
    if (!editing) {
      Esp32BaseWeb::sendHeader("编辑计划");
      Esp32BaseWeb::sendChunk("<h1>编辑计划</h1><section><h2>计划不存在</h2><p>指定计划不存在或参数无效。</p><p><a href='/schedule'>返回计划</a></p></section>");
      Esp32BaseWeb::sendFooter();
      return;
    }
  } else {
    config.timeConfigured = true;
    config.timeMinutes = 8 * 60;
    config.channelMask = 0;
  }

  Esp32BaseWeb::sendHeader(editing ? "编辑计划" : "新增计划");
  Esp32BaseWeb::sendChunk(editing ? "<h1>编辑计划</h1>" : "<h1>新增计划</h1>");
  Esp32BaseWeb::sendChunk("<section><p>计划蓝本只保存每天固定执行规则；跳过某次执行请回到计划页操作今日或明日实例。</p>");
  Esp32BaseWeb::sendChunk("<form method='post' action='");
  Esp32BaseWeb::sendChunk(editing ? "/api/app/schedules/update" : "/api/app/schedules/create");
  Esp32BaseWeb::sendChunk("'>");
  if (editing) {
    Esp32BaseWeb::sendChunk("<input type='hidden' name='planId' value='");
    sendUint8(planId);
    Esp32BaseWeb::sendChunk("'>");
  }
  Esp32BaseWeb::sendChunk("<label>计划名称 <input name='name' maxlength='");
  sendUint8(kFeederPlanNameMaxBytes);
  Esp32BaseWeb::sendChunk("' value='");
  Esp32BaseWeb::writeHtmlEscaped(config.name);
  Esp32BaseWeb::sendChunk("'></label><label>启用 <select name='enabled'><option value='1'");
  if (config.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">启用</option><option value='0'");
  if (!config.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">停用</option></select></label><label>执行时间（当天分钟 0-1439） <input name='timeMinutes' value='");
  if (config.timeConfigured) {
    sendUint32(config.timeMinutes);
  }
  Esp32BaseWeb::sendChunk("'></label><label>参与通道掩码 <input name='channelMask' value='");
  sendUint8(config.channelMask);
  Esp32BaseWeb::sendChunk("'></label>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    sendPlanTargetInputs(config, i);
  }
  Esp32BaseWeb::sendChunk("<button>");
  Esp32BaseWeb::sendChunk(editing ? "保存计划" : "创建计划");
  Esp32BaseWeb::sendChunk("</button> <a href='/schedule'>返回计划</a></form></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendRecordsPage() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::sendHeader("喂食记录");
  Esp32BaseWeb::sendChunk("<h1>记录</h1><section><h2>业务记录查询</h2>");
  Esp32BaseWeb::sendChunk("<form method='get' action='/api/app/records'>");
  Esp32BaseWeb::sendChunk("<label>开始序号 <input name='start' value='0'></label> ");
  Esp32BaseWeb::sendChunk("<label>每页 <input name='limit' value='16'></label> ");
  Esp32BaseWeb::sendChunk("<label>归档 <input name='archive' value='0'></label> ");
  Esp32BaseWeb::sendChunk("<label>开始时间戳 <input name='startUnixTime'></label> ");
  Esp32BaseWeb::sendChunk("<label>结束时间戳 <input name='endUnixTime'></label> ");
  Esp32BaseWeb::sendChunk("<label>事件类型 <input name='eventType' placeholder='FeederManualRequested'></label> ");
  Esp32BaseWeb::sendChunk("<button>查询 JSON</button></form>");
  Esp32BaseWeb::sendChunk("<p>归档 0 表示当前文件，1-16 表示轮转归档文件。</p></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendBaseInfoPage() {
#if ESP32BASE_ENABLE_WEB
  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  Esp32BaseWeb::sendHeader("基础信息");
  Esp32BaseWeb::sendChunk("<h1>基础信息</h1><section><h2>通道基础信息</h2><table>");
  Esp32BaseWeb::sendChunk("<tr><th>通道</th><th>名称</th><th>启用</th><th>每圈信号数</th><th>每圈克数</th><th>满桶容量</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const FeederBucketState& channel = buckets.channels[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendUint8(static_cast<uint8_t>(i + 1));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(channel.baseInfo.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(channel.baseInfo.enabled ? "是" : "否");
    Esp32BaseWeb::sendChunk("</td><td>");
    sendInt32(channel.baseInfo.outputPulsesPerRev);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendFixedX100(channel.baseInfo.gramsPerRevX100);
    Esp32BaseWeb::sendChunk(" g</td><td>");
    sendFixedX100(channel.baseInfo.capacityGramsX100);
    Esp32BaseWeb::sendChunk(" g</td><td><a href='/base-info/edit?channel=");
    sendUint8(i);
    Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table><p>当前余量属于运行维护数据，在首页“料桶余量”中维护；本页只管理通道基础信息。</p></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmFeederApp::sendBaseInfoEditPage() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channel = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
    Esp32BaseWeb::sendHeader("编辑通道");
    Esp32BaseWeb::sendChunk("<h1>编辑通道</h1><section><h2>通道不存在</h2><p>指定通道不存在或参数无效。</p><p><a href='/base-info'>返回基础信息</a></p></section>");
    Esp32BaseWeb::sendFooter();
    return;
  }

  const FeederBucketSnapshot buckets = g_buckets.snapshot();
  const FeederBucketState& info = buckets.channels[channel];
  Esp32BaseWeb::sendHeader("编辑通道");
  Esp32BaseWeb::sendChunk("<h1>编辑通道</h1><section><h2>");
  Esp32BaseWeb::writeHtmlEscaped(info.baseInfo.name);
  Esp32BaseWeb::sendChunk("</h2><p>修改会影响后续手工喂食、计划投喂和料桶余量估算。运行中不能保存。</p>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/base-info/channel'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='channel' value='");
  sendUint8(channel);
  Esp32BaseWeb::sendChunk("'>");
  Esp32BaseWeb::sendChunk("<label>名称 <input name='name' maxlength='");
  sendUint8(kFeederChannelNameMaxBytes);
  Esp32BaseWeb::sendChunk("' value='");
  Esp32BaseWeb::writeHtmlEscaped(info.baseInfo.name);
  Esp32BaseWeb::sendChunk("'></label> ");
  Esp32BaseWeb::sendChunk("<label>启用 <select name='enabled'><option value='1'");
  if (info.baseInfo.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">启用</option><option value='0'");
  if (!info.baseInfo.enabled) {
    Esp32BaseWeb::sendChunk(" selected");
  }
  Esp32BaseWeb::sendChunk(">停用</option></select></label> ");
  Esp32BaseWeb::sendChunk("<label>每圈信号数 <input name='outputPulsesPerRev' value='");
  sendInt32(info.baseInfo.outputPulsesPerRev);
  Esp32BaseWeb::sendChunk("'></label> ");
  Esp32BaseWeb::sendChunk("<label>每圈克数 <input name='gramsPerRev' value='");
  sendFixedX100(info.baseInfo.gramsPerRevX100);
  Esp32BaseWeb::sendChunk("'></label> ");
  Esp32BaseWeb::sendChunk("<label>满桶容量（克） <input name='capacityGrams' value='");
  sendFixedX100(info.baseInfo.capacityGramsX100);
  Esp32BaseWeb::sendChunk("'></label> ");
  Esp32BaseWeb::sendChunk("<label>确认 token <input name='confirmToken'></label> ");
  Esp32BaseWeb::sendChunk("<label>确认 <input name='confirm' value='true'></label> ");
  Esp32BaseWeb::sendChunk("<button>保存通道</button> <a href='/base-info'>返回基础信息</a></form></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

