tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::FaultCleared;
  record.result = successMask != 0 && skippedMask == 0
                    ? FeederRecordResult::Ok
                    : (successMask != 0 ? FeederRecordResult::Partial
                                        : FeederRecordResult::InvalidArgument);
  record.requestedMask = channelMask;
  record.successMask = successMask;
  record.skippedMask = skippedMask;
  recordBusinessEvent(record);

  beginRawJson(successMask != 0 ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(successMask != 0 && skippedMask == 0
                            ? "Ok"
                            : (successMask != 0 ? "Partial" : "InvalidArgument"));
  Esp32BaseWeb::sendChunk("\",\"commandId\":");
  sendUint32(commandId);
  Esp32BaseWeb::sendChunk(",\"requestedMask\":");
  sendUint8(channelMask);
  Esp32BaseWeb::sendChunk(",\"successMask\":");
  sendUint8(successMask);
  Esp32BaseWeb::sendChunk(",\"skippedMask\":");
  sendUint8(skippedMask);
  Esp32BaseWeb::sendChunk(",\"motorOutput\":{\"enabled\":false}}");
  endRawJson();
#endif
}

void FarmFeederApp::handleScheduleCreate() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  FeederPlanConfig config;
  if (!readPlanConfigFromParams(config)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederScheduleMutation mutation = g_schedules.addPlan(config);
  if (mutation.result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  beginRawJson(mutation.result == FeederScheduleResult::Ok ? 200 : 400);
  Esp32BaseWeb::sendChunk("{\"result\":\"");
  Esp32BaseWeb::sendChunk(scheduleResultName(mutation.result));
  Esp32BaseWeb::sendChunk("\",\"planId\":");
  sendUint8(mutation.planId);
  Esp32BaseWeb::sendChunk("}");
  endRawJson();
#endif
}

void FarmFeederApp::handleScheduleUpdate() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  FeederPlanConfig config;
  if (!readUint8Param("planId", planId) || !readPlanConfigFromParams(config)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederScheduleResult result = g_schedules.updatePlan(planId, config);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 400, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleDelete() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  if (!readUint8Param("planId", planId)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u", static_cast<unsigned>(planId));
  if (!requireConfirm("delete-plan", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.deletePlan(planId);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleSkip() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  uint32_t serviceDate = g_schedules.snapshot().serviceDate;
  if (!readUint8Param("planId", planId) || !readUint32ParamOptional("date", serviceDate) ||
      serviceDate == 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u:%lu",
           static_cast<unsigned>(planId),
           static_cast<unsigned long>(serviceDate));
  if (!requireConfirm("skip-occurrence", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.skipOccurrence(planId, serviceDate);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleScheduleCancelSkip() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t planId = 0;
  uint32_t serviceDate = g_schedules.snapshot().serviceDate;
  if (!readUint8Param("planId", planId) || !readUint32ParamOptional("date", serviceDate) ||
      serviceDate == 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (!schedulePlanExists(planId)) {
    sendResultJson(404, "NotFound");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "plan:%u:%lu",
           static_cast<unsigned>(planId),
           static_cast<unsigned long>(serviceDate));
  if (!requireConfirm("cancel-skip", resource)) {
    return;
  }
  const FeederScheduleResult result = g_schedules.cancelSkipOccurrence(planId, serviceDate);
  if (result == FeederScheduleResult::Ok) {
    persistFeederScheduleIfReady();
  }
  sendResultJson(result == FeederScheduleResult::Ok ? 200 : 404, scheduleResultName(result));
#endif
}

void FarmFeederApp::handleBucketSetRemaining() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  int32_t remainGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readFixedX100ParamOptional("remainGrams", "remainGramsX100", remainGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("set-bucket", resource)) {
    return;
  }
  const FeederBucketResult result = g_buckets.setRemaining(channel, remainGramsX100, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

void FarmFeederApp::handleBucketAddFeed() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  int32_t addedGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readFixedX100ParamOptional("addedGrams", "addedGramsX100", addedGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("add-feed", resource)) {
    return;
  }
  const FeederBucketResult result = g_buckets.addFeed(channel, addedGramsX100, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

void FarmFeederApp::handleBucketMarkFull() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "bucket:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("mark-full", resource)) {
    return;
  }
  const FeederBucketResult result = g_buckets.markFull(channel, 0);
  if (result == FeederBucketResult::Ok) {
    persistFeederBucketsIfReady();
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}

void FarmFeederApp::handleBaseInfoChannel() {
#if ESP32BASE_ENABLE_WEB
  if (!requireApiAuth()) {
    return;
  }
  uint8_t channel = 0;
  bool enabled = false;
  int32_t outputPulsesPerRev = 0;
  int32_t gramsPerRevX100 = 0;
  int32_t capacityGramsX100 = 0;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readBoolParam("enabled", enabled) ||
      !readInt32Param("outputPulsesPerRev", outputPulsesPerRev) ||
      !readFixedX100ParamOptional("gramsPerRev", "gramsPerRevX100", gramsPerRevX100) ||
      !readFixedX100ParamOptional("capacityGrams", "capacityGramsX100", capacityGramsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  if (g_feeder.snapshot().runningChannelMask != 0) {
    sendResultJson(400, "Busy");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "base-info:%u", static_cast<unsigned>(channel));
  if (!requireConfirm("base-info", resource)) {
    return;
  }

  FeederChannelBaseInfo info;
  info = g_buckets.snapshot().channels[channel].baseInfo;
  readChannelNameParam(info);
  info.enabled = enabled;
  info.outputPulsesPerRev = outputPulsesPerRev;
  info.gramsPerRevX100 = gramsPerRevX100;
  info.capacityGramsX100 = capacityGramsX100;
  const FeederBucketResult result = g_buckets.updateBaseInfo(channel, info);
  if (result == FeederBucketResult::Ok) {
    syncFeederConfigFromBaseInfo();
    persistFeederCalibrationIfReady();
    persistFeederBucketsIfReady();
  }
  sendResultJson(result == FeederBucketResult::Ok ? 200 : 400, bucketResultName(result));
#endif
}
